pulseaudio_dlna/plugins/dlna/upnp/xml/set_volume.xml

<?xml version='1.0' encoding='{encoding}'?>
<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/" s:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
  <s:Body>
    <u:SetVolume xmlns:u="{service_type}">
      <DesiredVolume>{volume}</DesiredVolume>
      <Channel>{channel}</Channel>
      <InstanceID>0</InstanceID>
    </u:SetVolume>
  </s:Body>
</s:Envelope>